
class errors():
    chap_error = str(
    ........................................................
    .  خطا: این چند مورد را با دقت بررسی نمائید            .
    .                                                      .
    .                                                      .
    .  شناسه های وارد شده را چک کنید                       .
    .                                                      .
    .  اینترنت تلفن همراه یا کامپیوتر خود را چک کنید       .
    .                                                      .
    .  مقادیر داخلی متود را چک کنید                        .
    ........................................................
)
